tools/load-testing/quick-test.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Light load test"
  processor: "./test-functions.js"

scenarios:
  - name: "Basic user flow"
    flow:
      - get:
          url: "/"
      - get:
          url: "/api/products"
      - post:
          url: "/api/analytics/track"
          json:
            event: "test_event"
            variant: "A"